#+TITLE: Xaviard: The Mad Artificer
#+OPTIONS: num:nil toc:1
#+STARTUP: entitiespretty
* Synopsis
* Xaviard
/medium construct/humanoid, neutral evil/
- Armor Class :: 19
- Hit Points :: 162 (18d8+18)
- Speed :: 30ft., fly 30ft. (hover)
| STR | DEX | CON | INT | WIS | CHA |
|-----+-----+-----+-----+-----+-----|
|  10 |  16 |  13 |  20 |  14 |  16 |
|   0 |   3 |   1 |   5 |   2 |   3 |
#+TBLFM: @3=floor((@2-10)/2)
- Saving Throws :: INT+12, WIS+9
- Damage Resisistances :: Cold, Lightning, Necrotic, Bludgeoning, Piecing, Slashing
- Damage Immunities :: Force, Poison, Radiant, Necrotic
- Condition Immunities :: Charmed, Frightened, Paralyzed, Poisoned
- Senses :: Blindsight 120ft; Passive Perception 19
- Languages :: Common, Elvish, Dwarvish, Draconic, Gnomish
** TODO Traits
- Legendary Resistance (3/Day). :: If Xaviard fails a saving throw, he can choose to succeed instead.
** TODO Actions
** TODO Legendary Actions
** TODO Lair Actions
** Spellcasting
Xaviard is an 18th-level spellcaster. His spellcasting ability is Intelligence (spell save DC 20, +12 to hit with spell attacks).
Xaviard has the following wizard spells prepared:
*** Cantrips
- [[http://dnd5e.wikidot.com/spell:booming-blade][Booming Blade]]
- [[http://dnd5e.wikidot.com/spell:guidance][Guidance]]
- [[http://dnd5e.wikidot.com/spell:lightning-lure][Lightning Lure]]
- [[http://dnd5e.wikidot.com/spell:mending][Mending]]
*** 1^st
- [[http://dnd5e.wikidot.com/spell:absorb-elements][Absorb Elements]]
- [[http://dnd5e.wikidot.com/spell:alarm][Alarm]]
- [[http://dnd5e.wikidot.com/spell:catapult][Catapult]]
- [[http://dnd5e.wikidot.com/spell:cure-wounds][Cure Wounds]][fn:1]
- [[http://dnd5e.wikidot.com/spell:false-life][False Life]]
- [[http://dnd5e.wikidot.com/spell:healing-word][Healing Word]][fn:1]
*** 2^nd
- [[http://dnd5e.wikidot.com/spell:guiding-bolt][Guiding Bolt]][fn:2]
- [[http://dnd5e.wikidot.com/spell:heat-metal][Heat Metal]]
*** 3^rd
-
*** 4^th
-
*** 5^th
-
*** 6^th
-
*** 7^th
-
*** 8^th
-
*** 9^th
-
** Footnotes: Xaviard
[fn:1] (at-will, Can only effect creatures with the /construct/ tag, ignores regular spell restrictions)
* Clockwork Spider
:PROPERTIES:
:CUSTOM_ID: clockwork-spider
:END:
/Large construct, neutral evil/
- Armor Class :: 16 (Metal plating)
- Hit Points :: 30 (4d10+5)
- 30ft, climb 30ft :: 
| STR | DEX | CON | INT | WIS | CHA |
|-----+-----+-----+-----+-----+-----|
|  15 |  15 |  17 |   1 |  12 |   4 |
|   2 |   2 |   3 |  -5 |   1 |  -3 |
#+TBLFM: @3=floor((@2-10)/2)
- Skills :: Acrobatics +7
- Senses :: Tremorsense 20ft., Darkvision 60ft., Passive Perception 11
- Languages :: Can understand all languages of its creator, but cannot speak.
- Challenge :: 1 (200XP)
- Proficiency Bonus :: +2
** Traits
- Spider Climb. :: The clockwork spider can climb difficult surfaces, including upside down on ceilings,
  without needing to make an ability check.
- Web Walker. :: The clockwork spider ignores movement restrictions caused by webbing.
** Actions
- Bite :: /Melee Weapon Attack:/ +5 to hit, reach 5ft., one creature. /Hit:/ 6 (2d4+2) piercing damage,
  and the target must make a DC 12 Constitution saving throw, taking 8 (4d4) damage force damage on a
  failed save, and half as much on a successful one.
- Paralyzing Bolt /(Recharge 5-6)/ :: /Ranged Weapon Attack:/ +5 to hit, range 30/60ft, one creature.
  /Hit:/ The target is paralyzed. As an action, the paralyzed target can make a DC 12 wisdom check, freeing
  themselves from the effects of the spell.
* Clockwork Reanimation


